Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.org
#+title: Chapter 13: Form Enhancement & Validation
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%} .content ul:not(:first-child) {margin-top: 0.25em}}</style>

* Navigation
| Nav   | Title                                                       | Links                                   |
|-------+-------------------------------------------------------------+-----------------------------------------|
| Index | Notes Home                                                  | \vert [[file:../../../index.html][html]] \vert [[file:../../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | JavaScript & JQuery - Interactive Front-end Web Development | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development][github]] \vert |
| Prev  | Chapter 12: Filtering, Searching, & Sorting                 | \vert [[file:../012.Filtering_Searching_and_Sorting/012.000.Notes.html][html]] \vert [[file:../012.Filtering_Searching_and_Sorting/012.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/012.Filtering_Searching_and_Sorting][github]] \vert |
| Next  | END                                                         |                                         |

* Notes

** Section 13.1: Introduction
   - Forms allow you to collect information from visitors and JavaScript can help you get the right information from them
   - Since JS was created, it has been used to enhance and validate forms
   - Enhancements make forms easier to use and validation checks whether the user has provided the right information before submitting the form (if not, it provides feedback to the user)
   - Form enhancement, HTML5 form elements, and form validation are all topics covered in this chapter

** Section 13.2: Helper Functions
   - Forms use a lot of event handlers and you can use jQuery to deal with cross-browser event handling
   - In the old days, Internet Explorer used a different event model than other browsers so if you do not want to include the entire jQuery script just to handle events in the older verions of IE, then you need to write your own fallback code to handle the events
   - Instead of writing the same fallback code every time you need an event handler, you can write the fallback code once in a helper function, and then call that function every time you need to add an event handler to a page
   - This function can check if ~addEventListener()~ is in the element of interest, if not, then we call ~attachEvent()~
   - However, since the ~attachEvent()~ does not pass the event object to the callback function, what the example code in the book does, is that it creates a method in the element and assigns it to the callback function
   - So now the element has the callback function, it then creates another method in the element, and this new method is calling the callback function and it passes the event object as an argument which is obtained by the ~window~ object
   - Finally, the ~attachEvent()~ is called and as the callback function it puts in the method created that calls the initial callback with the event object as the argument

** Section 13.3: The Form Element
   - The ~<form>~ element has different properties, methods, and events than some of the other elements
   - It has:
     - ~action~: The URL the form is submitted to
     - ~method~: If it is to be sent via ~GET~ or ~POST~
     - ~name~: Rarely used, more common to select a form y the value of its ~id~ attribute
     - ~elements~: A collection of the elements in the form that users can interact with (they can be accessed via index numbers or the values of their ~name~ attributes)
     - ~submit()~: This has the same effect as clicking the submit button on a form
     - ~reset()~: Resets the form to the initial values it had when the page loaded
     - ~submit~: Event fires when the form is submitted
     - ~reset~: Event fires when the form is reset

   - The ~document~ object has something called the ~forms collection~ and the forms collection holds a reference to each of the ~<form>~ elements that appear on a page
   - Each item in a collection is given an index number (a number starting at 0, like an array), so for example, to access the second form using its index number it would be something like: ~document.forms[1];~
   - You can also access a form using the value of its ~name~ attribute, for example, to select a form whose name attribute has a value of "login" it would be: ~document.forms.login~
   - Each form element in the page also has an ~elements.collection~ as it holds all of the forms controls within that form and each item in the elements collection can also be accessed by index number or by the value of its ~name~ attribute
   - For example, to access the second form on the page and select the first form control within it, it would be like: ~document.forms[1].elements[0]~
   - Another example of selecting the seconf form on the page and then selecting the element whose ~name~ attribute has a value of ~password~ from that form: ~document.forms[1].elements.password~
   - Note that index numbers in a collection of elements can change if the markup of a page is altered so the use of index numbers ties a script to the HTML markup (thus does NOT achieve a separation of concerns)

