Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-31 Fri 00:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 13: Form Enhancement &amp; Validation</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 13: Form Enhancement &amp; Validation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8b85a9d">Navigation</a></li>
<li><a href="#org4565e12">Notes</a>
<ul>
<li><a href="#org495ab37">Section 13.1: Introduction</a></li>
<li><a href="#orgf382b26">Section 13.2: Helper Functions</a></li>
<li><a href="#org2de5175">Section 13.3: The Form Element</a></li>
<li><a href="#org96cd46e">Section 13.4: Form Controls</a></li>
<li><a href="#org46fab87">Section 13.5: Select Boxes</a></li>
<li><a href="#orgcf679a7">Section 13.6: HTML5 Elements &amp; Attributes</a></li>
<li><a href="#org17141b9">Section 13.7: Form Validation</a></li>
<li><a href="#org9853f31">Section 13.8: Code Dependencies &amp; Reusue</a></li>
<li><a href="#org98ae0d8">Section 13.9: Chapter Exercise</a></li>
<li><a href="#orge406b2c">Section 13.10: Summary</a></li>
</ul>
</li>
<li><a href="#orge920b57">Keywords</a></li>
<li><a href="#orgf8bd2a2">Questions</a></li>
<li><a href="#orgb3c3af6">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8b85a9d" class="outline-2">
<h2 id="org8b85a9d">Navigation</h2>
<div class="outline-text-2" id="text-org8b85a9d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">JavaScript &amp; JQuery - Interactive Front-end Web Development</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 12: Filtering, Searching, &amp; Sorting</td>
<td class="org-left">&vert; <a href="../012.Filtering_Searching_and_Sorting/012.000.Notes.html">html</a> &vert; <a href="../012.Filtering_Searching_and_Sorting/012.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/012.Filtering_Searching_and_Sorting">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">END</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4565e12" class="outline-2">
<h2 id="org4565e12">Notes</h2>
<div class="outline-text-2" id="text-org4565e12">
</div>
<div id="outline-container-org495ab37" class="outline-3">
<h3 id="org495ab37">Section 13.1: Introduction</h3>
<div class="outline-text-3" id="text-org495ab37">
<ul class="org-ul">
<li>Forms allow you to collect information from visitors and JavaScript can help you get the right information from them</li>
<li>Since JS was created, it has been used to enhance and validate forms</li>
<li>Enhancements make forms easier to use and validation checks whether the user has provided the right information before submitting the form (if not, it provides feedback to the user)</li>
<li>Form enhancement, HTML5 form elements, and form validation are all topics covered in this chapter</li>
</ul>
</div>
</div>

<div id="outline-container-orgf382b26" class="outline-3">
<h3 id="orgf382b26">Section 13.2: Helper Functions</h3>
<div class="outline-text-3" id="text-orgf382b26">
<ul class="org-ul">
<li>Forms use a lot of event handlers and you can use jQuery to deal with cross-browser event handling</li>
<li>In the old days, Internet Explorer used a different event model than other browsers so if you do not want to include the entire jQuery script just to handle events in the older verions of IE, then you need to write your own fallback code to handle the events</li>
<li>Instead of writing the same fallback code every time you need an event handler, you can write the fallback code once in a helper function, and then call that function every time you need to add an event handler to a page</li>
<li>This function can check if <code>addEventListener()</code> is in the element of interest, if not, then we call <code>attachEvent()</code></li>
<li>However, since the <code>attachEvent()</code> does not pass the event object to the callback function, what the example code in the book does, is that it creates a method in the element and assigns it to the callback function</li>
<li>So now the element has the callback function, it then creates another method in the element, and this new method is calling the callback function and it passes the event object as an argument which is obtained by the <code>window</code> object</li>
<li>Finally, the <code>attachEvent()</code> is called and as the callback function it puts in the method created that calls the initial callback with the event object as the argument</li>
</ul>
</div>
</div>

<div id="outline-container-org2de5175" class="outline-3">
<h3 id="org2de5175">Section 13.3: The Form Element</h3>
<div class="outline-text-3" id="text-org2de5175">
<ul class="org-ul">
<li>The <code>&lt;form&gt;</code> element has different properties, methods, and events than some of the other elements</li>
<li>It has:
<ul class="org-ul">
<li><code>action</code>: The URL the form is submitted to</li>
<li><code>method</code>: If it is to be sent via <code>GET</code> or <code>POST</code></li>
<li><code>name</code>: Rarely used, more common to select a form y the value of its <code>id</code> attribute</li>
<li><code>elements</code>: A collection of the elements in the form that users can interact with (they can be accessed via index numbers or the values of their <code>name</code> attributes)</li>
<li><code>submit()</code>: This has the same effect as clicking the submit button on a form</li>
<li><code>reset()</code>: Resets the form to the initial values it had when the page loaded</li>
<li><code>submit</code>: Event fires when the form is submitted</li>
<li><code>reset</code>: Event fires when the form is reset</li>
</ul></li>

<li>The <code>document</code> object has something called the <code>forms collection</code> and the forms collection holds a reference to each of the <code>&lt;form&gt;</code> elements that appear on a page</li>
<li>Each item in a collection is given an index number (a number starting at 0, like an array), so for example, to access the second form using its index number it would be something like: <code>document.forms[1];</code></li>
<li>You can also access a form using the value of its <code>name</code> attribute, for example, to select a form whose name attribute has a value of "login" it would be: <code>document.forms.login</code></li>
<li>Each form element in the page also has an <code>elements.collection</code> as it holds all of the forms controls within that form and each item in the elements collection can also be accessed by index number or by the value of its <code>name</code> attribute</li>
<li>For example, to access the second form on the page and select the first form control within it, it would be like: <code>document.forms[1].elements[0]</code></li>
<li>Another example of selecting the seconf form on the page and then selecting the element whose <code>name</code> attribute has a value of <code>password</code> from that form: <code>document.forms[1].elements.password</code></li>
<li>Note that index numbers in a collection of elements can change if the markup of a page is altered so the use of index numbers ties a script to the HTML markup (thus does NOT achieve a separation of concerns)</li>
</ul>
</div>
</div>
