Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.org
** Section 13.4: Form Controls
   - Each type of form control uses a different combination of the properties, methods, and events
   - Note that the methods can be used to simulate how a user would interact with the form controls
   - Properties:
     - ~value~: In a text input, it is the text the user entered; otherwise, it is the value of the ~value~ attribute
     - ~type~: When a form control has been created using the ~<input>~ element, this defines the ~type~ of the form element (e.g. ~text~, ~password~, etc.)
     - ~name~: Gets or sets the value of the ~name~ attribute
     - ~defaultValue~: The initial value of a text box or text area when the page is rendered
     - ~form~: The form that the control belongs to
     - ~disabled~: Disables the ~<form>~ element
     - ~checked~: Indicates which checkbox or radio buttons have been checked (this property is a boolean; in JS it will have a value of ~true~ if checked)
     - ~defaultChecked~: Whether the checkbox or radio button was checked or not when the page loaded
     - ~selected~: Indicates that an item from a select box has been selected (boolean - ~true~ if selected)

   - Methods:
     - ~focus()~: Gives an element focus
     - ~blur()~: Removes focus from an element
     - ~select()~: Selects and highlights text content of an element (e.g, text inputs, text areas, and passwords)
     - ~click()~: Triggers a ~click~ event upon buttons, checkboxes, and file upload (also triggers a ~submit~ event on a submit button and the ~reset~ event on a reset button)

   - Events:
     - ~blur~: When the user leaves a field
     - ~focus~: When the user enters a field
     - ~click~: When the user clicks on an element
     - ~change~: When the value of an element changes
     - ~input~: When the value of ~<input>~ or ~<textarea>~ element changes
     - ~keydown~, ~keyup~, ~keypress~: When the user interacts with a keyboard

** Section 13.5: Select Boxes
   - The ~<select>~ element is more complex than the other form controls
   - Its DOM node has a number of extra properties and methods
   - Its ~<option>~ elements contain the values a user can select
   - The ~<select>~ element also has some extra properties and methods that are specific to it
   - If you want to work with the individual options the user can select from, a collection of ~<option>~ elements is available
   - Propeties of ~<select>~:
     - ~options~: A collection of all the ~<option>~ elements
     - ~selectedIndex~: Index number of the option that is currently option
     - ~length~: Number of options
     - ~multiple~: Allows users to select multiple options from the select box (rarely used because the user-experience is not very good)
     - ~selectedOptions~: A collection of all the selected ~<option>~ elements
   - Methods of ~<select>~:
     - ~add(option, before)~: Adds an item to the list (the first parameter is the new option and the second is the element it should go before and if no value is given, the item will be added to the end of the options)
     - ~remove(index)~: Removes an item from the list (has only one parameter - the index number of the option to be removed)

** Section 13.6: HTML5 Elements & Attributes
   - HTML5 adds form elements and attributes to perform tasks that has previously been performed by JavaScript, however, their appearance can vary a lot between different browsers (especially their error messages)
   - Attributes:
     - ~autofocus~: Gives focus to this element when the page is loaded
     - ~placeholder~: Content of this attribute is shown in the ~<input>~
     - ~required~: Checks the field has a value - could be text entered or an option selected
     - ~min~: Minimum permitted number
     - ~max~: Maximum permitted number
     - ~step~: Intervals by which numbers should increase or decrease
     - ~value~: Default value for a number when the control first loads on the page
     - ~autocomplete~: On by default - shows list of past entries (disable for credit card numbers / sensitive data)
     - ~pattern~: Lets you to specify a regular expression to validate a value
     - ~nonvalidate~: Used on the ~<form>~ element to disable the HTML5 built-in form validation
   - Outdated, but polyfill is a script that provides functionality you may expect a browser to support by default (so a polyfill script may help support new features in older browsers) - this isn't an issue anymore as browsers tend to be standardized with features
   - Before, a conditional loader was common, which will let you load different files depending on whether a condition returns true or false
   - This allows developers to only load polyfill scripts when the user's browser does not support certain features

** Section 13.7: Form Validation
   - Validation is the process of checking whether a value meets certain rules (e.g. a password has a minimum number of characters)
   - Validation tells the users if there is a problem with the values they entered so that they can correct the form before they resubmit it
   - Validation on the browser helps receive input in the format needed, it is faster to do browser validation than server validation, and it saves resources on the server
   - The validation done by the browser will be triggered by the submit event (not click or any other event)
   - Regex is often used to check for patterns in strings and helps validate user input and can be tested using ~regexExpression.test(str)~ which returns true or false meaning if the pattern was found or not in the string
   - So regex expressions can search for characters that form a pattern and they can also replace those characters with new ones

** Section 13.8: Code Dependencies & Reusue
   - It is always best practice to avoid writing duplicate code and reusing code when possible
   - Try to use the DRY principle: don't repeat yourself
   - Whenever a script depends on another script the script it uses is referred to as a dependency to the JS file that uses it
   - Code reuse may lead to smaller scripts and more code dependencies

