Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.html

<div id="outline-container-org96cd46e" class="outline-3">
<h3 id="org96cd46e">Section 13.4: Form Controls</h3>
<div class="outline-text-3" id="text-org96cd46e">
<ul class="org-ul">
<li>Each type of form control uses a different combination of the properties, methods, and events</li>
<li>Note that the methods can be used to simulate how a user would interact with the form controls</li>
<li>Properties:
<ul class="org-ul">
<li><code>value</code>: In a text input, it is the text the user entered; otherwise, it is the value of the <code>value</code> attribute</li>
<li><code>type</code>: When a form control has been created using the <code>&lt;input&gt;</code> element, this defines the <code>type</code> of the form element (e.g. <code>text</code>, <code>password</code>, etc.)</li>
<li><code>name</code>: Gets or sets the value of the <code>name</code> attribute</li>
<li><code>defaultValue</code>: The initial value of a text box or text area when the page is rendered</li>
<li><code>form</code>: The form that the control belongs to</li>
<li><code>disabled</code>: Disables the <code>&lt;form&gt;</code> element</li>
<li><code>checked</code>: Indicates which checkbox or radio buttons have been checked (this property is a boolean; in JS it will have a value of <code>true</code> if checked)</li>
<li><code>defaultChecked</code>: Whether the checkbox or radio button was checked or not when the page loaded</li>
<li><code>selected</code>: Indicates that an item from a select box has been selected (boolean - <code>true</code> if selected)</li>
</ul></li>

<li>Methods:
<ul class="org-ul">
<li><code>focus()</code>: Gives an element focus</li>
<li><code>blur()</code>: Removes focus from an element</li>
<li><code>select()</code>: Selects and highlights text content of an element (e.g, text inputs, text areas, and passwords)</li>
<li><code>click()</code>: Triggers a <code>click</code> event upon buttons, checkboxes, and file upload (also triggers a <code>submit</code> event on a submit button and the <code>reset</code> event on a reset button)</li>
</ul></li>

<li>Events:
<ul class="org-ul">
<li><code>blur</code>: When the user leaves a field</li>
<li><code>focus</code>: When the user enters a field</li>
<li><code>click</code>: When the user clicks on an element</li>
<li><code>change</code>: When the value of an element changes</li>
<li><code>input</code>: When the value of <code>&lt;input&gt;</code> or <code>&lt;textarea&gt;</code> element changes</li>
<li><code>keydown</code>, <code>keyup</code>, <code>keypress</code>: When the user interacts with a keyboard</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org46fab87" class="outline-3">
<h3 id="org46fab87">Section 13.5: Select Boxes</h3>
<div class="outline-text-3" id="text-org46fab87">
<ul class="org-ul">
<li>The <code>&lt;select&gt;</code> element is more complex than the other form controls</li>
<li>Its DOM node has a number of extra properties and methods</li>
<li>Its <code>&lt;option&gt;</code> elements contain the values a user can select</li>
<li>The <code>&lt;select&gt;</code> element also has some extra properties and methods that are specific to it</li>
<li>If you want to work with the individual options the user can select from, a collection of <code>&lt;option&gt;</code> elements is available</li>
<li>Propeties of <code>&lt;select&gt;</code>:
<ul class="org-ul">
<li><code>options</code>: A collection of all the <code>&lt;option&gt;</code> elements</li>
<li><code>selectedIndex</code>: Index number of the option that is currently option</li>
<li><code>length</code>: Number of options</li>
<li><code>multiple</code>: Allows users to select multiple options from the select box (rarely used because the user-experience is not very good)</li>
<li><code>selectedOptions</code>: A collection of all the selected <code>&lt;option&gt;</code> elements</li>
</ul></li>
<li>Methods of <code>&lt;select&gt;</code>:
<ul class="org-ul">
<li><code>add(option, before)</code>: Adds an item to the list (the first parameter is the new option and the second is the element it should go before and if no value is given, the item will be added to the end of the options)</li>
<li><code>remove(index)</code>: Removes an item from the list (has only one parameter - the index number of the option to be removed)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcf679a7" class="outline-3">
<h3 id="orgcf679a7">Section 13.6: HTML5 Elements &amp; Attributes</h3>
<div class="outline-text-3" id="text-orgcf679a7">
<ul class="org-ul">
<li>HTML5 adds form elements and attributes to perform tasks that has previously been performed by JavaScript, however, their appearance can vary a lot between different browsers (especially their error messages)</li>
<li>Attributes:
<ul class="org-ul">
<li><code>autofocus</code>: Gives focus to this element when the page is loaded</li>
<li><code>placeholder</code>: Content of this attribute is shown in the <code>&lt;input&gt;</code></li>
<li><code>required</code>: Checks the field has a value - could be text entered or an option selected</li>
<li><code>min</code>: Minimum permitted number</li>
<li><code>max</code>: Maximum permitted number</li>
<li><code>step</code>: Intervals by which numbers should increase or decrease</li>
<li><code>value</code>: Default value for a number when the control first loads on the page</li>
<li><code>autocomplete</code>: On by default - shows list of past entries (disable for credit card numbers / sensitive data)</li>
<li><code>pattern</code>: Lets you to specify a regular expression to validate a value</li>
<li><code>nonvalidate</code>: Used on the <code>&lt;form&gt;</code> element to disable the HTML5 built-in form validation</li>
</ul></li>
<li>Outdated, but polyfill is a script that provides functionality you may expect a browser to support by default (so a polyfill script may help support new features in older browsers) - this isn't an issue anymore as browsers tend to be standardized with features</li>
<li>Before, a conditional loader was common, which will let you load different files depending on whether a condition returns true or false</li>
<li>This allows developers to only load polyfill scripts when the user's browser does not support certain features</li>
</ul>
</div>
</div>

<div id="outline-container-org17141b9" class="outline-3">
<h3 id="org17141b9">Section 13.7: Form Validation</h3>
<div class="outline-text-3" id="text-org17141b9">
<ul class="org-ul">
<li>Validation is the process of checking whether a value meets certain rules (e.g. a password has a minimum number of characters)</li>
<li>Validation tells the users if there is a problem with the values they entered so that they can correct the form before they resubmit it</li>
<li>Validation on the browser helps receive input in the format needed, it is faster to do browser validation than server validation, and it saves resources on the server</li>
<li>The validation done by the browser will be triggered by the submit event (not click or any other event)</li>
<li>Regex is often used to check for patterns in strings and helps validate user input and can be tested using <code>regexExpression.test(str)</code> which returns true or false meaning if the pattern was found or not in the string</li>
<li>So regex expressions can search for characters that form a pattern and they can also replace those characters with new ones</li>
</ul>
</div>
</div>

<div id="outline-container-org9853f31" class="outline-3">
<h3 id="org9853f31">Section 13.8: Code Dependencies &amp; Reusue</h3>
<div class="outline-text-3" id="text-org9853f31">
<ul class="org-ul">
<li>It is always best practice to avoid writing duplicate code and reusing code when possible</li>
<li>Try to use the DRY principle: don't repeat yourself</li>
<li>Whenever a script depends on another script the script it uses is referred to as a dependency to the JS file that uses it</li>
<li>Code reuse may lead to smaller scripts and more code dependencies</li>
</ul>
</div>
</div>
