Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.org
** Section 13.9: Chapter Exercise
   - We are going to create a form similar to the chapter example
   - This form will have the following properties:
     - Name: text
     - Email: email
     - Password: password
     - Confirm Password: password
     - Birthdate: date
     - Short Bio: textarea
     - Parental Consent: Checkbox
   - The form will not be submitted to any server
   - The form will only check for the validity of the inputs
   - Name is required and must be at 3 characters
   - Email is required must be a valid text in a email format
   - Password is required and must be at least 8 characters, contain a number, a lowercase, a uppercase, and a special character such as: !, -, _, #, $, %
   - Password and confirm password must match
   - Birthdate must be a valid birthdate
   - Short bio is required and must be at least 10 characters but no more than 140 characters
   - Parental Consent must be checked if user is younger than 13
   - Unlike the chapter example where validation occurs only when the form is submitted
   - The validation in my exercise will be performed as the user enters the input and/or goes out focus of the input, as well as submitting the form
   - This allows the user to see any errors before even submitting the form, thus saving time and hopefully giving the user a better user experience
   - [[file:./013.009.Chapter_Exercise/index.html][Here]] is my chapter exercise

** Section 13.10: Summary
   - Form enhancements make your form easier to use
   - Validation lets you give users feedback before the form data is sent to the server
   - HTML5 introduced new form controls which feature validation (only works in modern or mobile browsers)
   - HTML5 inputs and their validation messages look different in various browsers
   - You can use JavaScript to offer the same functionality as the new HTML5 elements in all browsers (and control how they appear in all browsers)
   - Libraries like jQuery UI help create forms that look the same across different browsers
   - Regular expressions help you find patterns of characters in a string
        
* Keywords
| Term            | Definition                                                                                                                                                                                                                                                                                                                                           |
|-----------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Form validation | The process of ensuring that the user-submitted data is accurate, complete, and in the correct form, preventing incorrect or malicious input from being processed                                                                                                                                                                                    |
| Code Dependency | A code dependency is a piece of software that a program relies on to run (e.g. if program A needs program B then program B is a code dependency for program A)                                                                                                                                                                                       |
| DRY Principle   | DRY means Don't Repeat Yourself and it is a software development best practice that advocates for every piece of knowledge to have a single, unambiguous, authoritative representation within a system (basically reduce redundancy by consolidating duplicate code and logic into a single, reusable location such as a function, class, or module) |

* Questions
  - *Q*: In JavaScript, do you place code dependencies in the HTML file as ~<script>~ tags before the script that needs it or do you use the ~import~ inside the JS file?
         - Traditionally, JavaScript didn't have a built-in module system so to use code dependencies you would have to add them by using the ~<script>~ tag in HTML
	 - The browser would load each file in the order they appeared, so dependencies had to come first
	 - This was common around the 2000s to the early 2010s
	 - JavaScript finally got native modules (ES Modules or "ESM") standardized in 2015 (ES6) and fully supported in browsers a few years later
	 - So now you can use the keyword ~import~ in your JavaScript to load a code dependency (especially if using npm as your package manager) and the module system handles dependencies
	 - Using the module system you declare imports directly in your JS files and only your script in HTML using the ~<script>~ tag and the attribute ~type~ with the value of ~module~
	   
  - *Q*: Can dependencies loop exist in JS? What if script A imports script B and script B imports script C and script C imports script A?
         - Loop dependencies can exist and can cause problems
	 - When ES modules are loaded, the browser builds a dependency graph and if it detects a circular dependency:
	   - It creates module objects for each file
	   - It starts executing the modules in order (so if A imports B then it loads B but if B imports C then it loads C but if C imports A then it loads A but A is already loading so partially or uninitialized modules are given)
	   - If a module tries to import something that hasn't finished loading yet (because of the loop), it gets an incomplete version - often undefined for functions or variables that haven't been initialized yet
	 - So it is best to avoid circular dependencies by restructing the modules so the dependency graph is one-directional, the extracted shared logic is placed into a new module such as ~utils.js~ that multiple files can import or sometimes use lazy imports (e.g. import inside a function) to delay loading until needed

