Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.html

<div id="outline-container-org98ae0d8" class="outline-3">
<h3 id="org98ae0d8">Section 13.9: Chapter Exercise</h3>
<div class="outline-text-3" id="text-org98ae0d8">
<ul class="org-ul">
<li>We are going to create a form similar to the chapter example</li>
<li>This form will have the following properties:
<ul class="org-ul">
<li>Name: text</li>
<li>Email: email</li>
<li>Password: password</li>
<li>Confirm Password: password</li>
<li>Birthdate: date</li>
<li>Short Bio: textarea</li>
<li>Parental Consent: Checkbox</li>
</ul></li>
<li>The form will not be submitted to any server</li>
<li>The form will only check for the validity of the inputs</li>
<li>Name is required and must be at 3 characters</li>
<li>Email is required must be a valid text in a email format</li>
<li>Password is required and must be at least 8 characters, contain a number, a lowercase, a uppercase, and a special character such as: !, -, _, #, $, %</li>
<li>Password and confirm password must match</li>
<li>Birthdate must be a valid birthdate</li>
<li>Short bio is required and must be at least 10 characters but no more than 140 characters</li>
<li>Parental Consent must be checked if user is younger than 13</li>
<li>Unlike the chapter example where validation occurs only when the form is submitted</li>
<li>The validation in my exercise will be performed as the user enters the input and/or goes out focus of the input, as well as submitting the form</li>
<li>This allows the user to see any errors before even submitting the form, thus saving time and hopefully giving the user a better user experience</li>
<li><a href="./013.009.Chapter_Exercise/index.html">Here</a> is my chapter exercise</li>
</ul>
</div>
</div>

<div id="outline-container-orge406b2c" class="outline-3">
<h3 id="orge406b2c">Section 13.10: Summary</h3>
<div class="outline-text-3" id="text-orge406b2c">
<ul class="org-ul">
<li>Form enhancements make your form easier to use</li>
<li>Validation lets you give users feedback before the form data is sent to the server</li>
<li>HTML5 introduced new form controls which feature validation (only works in modern or mobile browsers)</li>
<li>HTML5 inputs and their validation messages look different in various browsers</li>
<li>You can use JavaScript to offer the same functionality as the new HTML5 elements in all browsers (and control how they appear in all browsers)</li>
<li>Libraries like jQuery UI help create forms that look the same across different browsers</li>
<li>Regular expressions help you find patterns of characters in a string</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge920b57" class="outline-2">
<h2 id="orge920b57">Keywords</h2>
<div class="outline-text-2" id="text-orge920b57">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Form validation</td>
<td class="org-left">The process of ensuring that the user-submitted data is accurate, complete, and in the correct form, preventing incorrect or malicious input from being processed</td>
</tr>

<tr>
<td class="org-left">Code Dependency</td>
<td class="org-left">A code dependency is a piece of software that a program relies on to run (e.g. if program A needs program B then program B is a code dependency for program A)</td>
</tr>

<tr>
<td class="org-left">DRY Principle</td>
<td class="org-left">DRY means Don't Repeat Yourself and it is a software development best practice that advocates for every piece of knowledge to have a single, unambiguous, authoritative representation within a system (basically reduce redundancy by consolidating duplicate code and logic into a single, reusable location such as a function, class, or module)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf8bd2a2" class="outline-2">
<h2 id="orgf8bd2a2">Questions</h2>
<div class="outline-text-2" id="text-orgf8bd2a2">
<ul class="org-ul">
<li><b>Q</b>: In JavaScript, do you place code dependencies in the HTML file as <code>&lt;script&gt;</code> tags before the script that needs it or do you use the <code>import</code> inside the JS file?
<ul class="org-ul">
<li>Traditionally, JavaScript didn't have a built-in module system so to use code dependencies you would have to add them by using the <code>&lt;script&gt;</code> tag in HTML</li>
<li>The browser would load each file in the order they appeared, so dependencies had to come first</li>
<li>This was common around the 2000s to the early 2010s</li>
<li>JavaScript finally got native modules (ES Modules or "ESM") standardized in 2015 (ES6) and fully supported in browsers a few years later</li>
<li>So now you can use the keyword <code>import</code> in your JavaScript to load a code dependency (especially if using npm as your package manager) and the module system handles dependencies</li>
<li>Using the module system you declare imports directly in your JS files and only your script in HTML using the <code>&lt;script&gt;</code> tag and the attribute <code>type</code> with the value of <code>module</code></li>
</ul></li>

<li><b>Q</b>: Can dependencies loop exist in JS? What if script A imports script B and script B imports script C and script C imports script A?
<ul class="org-ul">
<li>Loop dependencies can exist and can cause problems</li>
<li>When ES modules are loaded, the browser builds a dependency graph and if it detects a circular dependency:
<ul class="org-ul">
<li>It creates module objects for each file</li>
<li>It starts executing the modules in order (so if A imports B then it loads B but if B imports C then it loads C but if C imports A then it loads A but A is already loading so partially or uninitialized modules are given)</li>
<li>If a module tries to import something that hasn't finished loading yet (because of the loop), it gets an incomplete version - often undefined for functions or variables that haven't been initialized yet</li>
</ul></li>
<li>So it is best to avoid circular dependencies by restructing the modules so the dependency graph is one-directional, the extracted shared logic is placed into a new module such as <code>utils.js</code> that multiple files can import or sometimes use lazy imports (e.g. import inside a function) to delay loading until needed</li>
</ul></li>
</ul>
</div>
</div>
