Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.org
* Summary
  - Forms allow you to collect info from visitors and JS can help validate the form and the user's input
  - Validation is the process of checking whether a value meets certain rules
  - Helper functions can be used to help provide functionality in older browsers and add event listeners so that the forms behave and interact the same regardless of browser
  - The ~<form>~ element has different properties, methods, and events than some of the other elements, it has ~action~, ~method~, ~name~, ~submit()~, ~reset()~, and more
  - You can get all the forms in a document by getting the forms collection by using something like: ~document.forms~ (which returns a collection of forms)
  - Then using a single form you can collect the form's elements using ~document.forms[0].elements~ which returns a collection of elements in the form which holds all of the forms controls within that form
  - Each item in the elements collection can also be accessed by the index number or by the value of its ~name~ attribute
  - Each type of form control uses a different combination of the properties, methods, and events and there are some methods that can be used to simulate how a user would interact with the form controls such as ~focus()~, ~blur()~, ~select()~, and ~click()~
  - ~<select>~ element has extra properties and methods such as ~options~ (collection of all the ~<option>~ elements), ~selectedIndex~ (index number of the option that is currently option), ~length~ (number of options), ~selectedOptions~ (a collection of all the selected ~<option>~ elements), and more
  - HTML5 has many form elements and attributes to perform validation tasks (previously it was done by JavaScript) but their appearance can vary between different browsers
  - Attributes like ~required~, ~min~, ~max~, ~autocomplete~, etc. are all attributes introduced in HTML5 which can help validate input elements without the need of JS
  - The last topic to cover is the DRY principle and code dependencies
  - DRY is don't repeat yourself so try to reuse code as much as possible
  - That means using libraries and code dependencies (other code)
  - Whenever a script depends on another script the script it uses is referred to as a dependency to the JS file that uses it
  - Code reuse may lead to smaller scripts and more code dependencies
  - However, when using code dependencies you have to be careful for loop dependencies
  - The browser creates a dependency graph and if there are any loops then issues may arise
  - The best way to solve this is to try and create a one-direction dependency graph, use lazy imports, or create one module with shared logic to break the loop
  - There two ways to import code dependencies, the older version is to add them by using the ~<script>~ tag in the HTML file and the browser would load each file in the order they appeared so the dependencies must come first in the HTML file
  - Or the newer option would be to use the keyword ~import~ in your JavaScript file to load a code dependency and the module system handles the dependencies
  - Only your script would be added using the ~<script>~ tag and the attribute ~type~ with the value of ~module~ to work since all dependencies would be imported in your script by the ~import~ keyword and the module system
