Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/013.Form_Enhancement_and_Validation/013.000.Notes.html

<div id="outline-container-orgb3c3af6" class="outline-2">
<h2 id="orgb3c3af6">Summary</h2>
<div class="outline-text-2" id="text-orgb3c3af6">
<ul class="org-ul">
<li>Forms allow you to collect info from visitors and JS can help validate the form and the user's input</li>
<li>Validation is the process of checking whether a value meets certain rules</li>
<li>Helper functions can be used to help provide functionality in older browsers and add event listeners so that the forms behave and interact the same regardless of browser</li>
<li>The <code>&lt;form&gt;</code> element has different properties, methods, and events than some of the other elements, it has <code>action</code>, <code>method</code>, <code>name</code>, <code>submit()</code>, <code>reset()</code>, and more</li>
<li>You can get all the forms in a document by getting the forms collection by using something like: <code>document.forms</code> (which returns a collection of forms)</li>
<li>Then using a single form you can collect the form's elements using <code>document.forms[0].elements</code> which returns a collection of elements in the form which holds all of the forms controls within that form</li>
<li>Each item in the elements collection can also be accessed by the index number or by the value of its <code>name</code> attribute</li>
<li>Each type of form control uses a different combination of the properties, methods, and events and there are some methods that can be used to simulate how a user would interact with the form controls such as <code>focus()</code>, <code>blur()</code>, <code>select()</code>, and <code>click()</code></li>
<li><code>&lt;select&gt;</code> element has extra properties and methods such as <code>options</code> (collection of all the <code>&lt;option&gt;</code> elements), <code>selectedIndex</code> (index number of the option that is currently option), <code>length</code> (number of options), <code>selectedOptions</code> (a collection of all the selected <code>&lt;option&gt;</code> elements), and more</li>
<li>HTML5 has many form elements and attributes to perform validation tasks (previously it was done by JavaScript) but their appearance can vary between different browsers</li>
<li>Attributes like <code>required</code>, <code>min</code>, <code>max</code>, <code>autocomplete</code>, etc. are all attributes introduced in HTML5 which can help validate input elements without the need of JS</li>
<li>The last topic to cover is the DRY principle and code dependencies</li>
<li>DRY is don't repeat yourself so try to reuse code as much as possible</li>
<li>That means using libraries and code dependencies (other code)</li>
<li>Whenever a script depends on another script the script it uses is referred to as a dependency to the JS file that uses it</li>
<li>Code reuse may lead to smaller scripts and more code dependencies</li>
<li>However, when using code dependencies you have to be careful for loop dependencies</li>
<li>The browser creates a dependency graph and if there are any loops then issues may arise</li>
<li>The best way to solve this is to try and create a one-direction dependency graph, use lazy imports, or create one module with shared logic to break the loop</li>
<li>There two ways to import code dependencies, the older version is to add them by using the <code>&lt;script&gt;</code> tag in the HTML file and the browser would load each file in the order they appeared so the dependencies must come first in the HTML file</li>
<li>Or the newer option would be to use the keyword <code>import</code> in your JavaScript file to load a code dependency and the module system handles the dependencies</li>
<li>Only your script would be added using the <code>&lt;script&gt;</code> tag and the attribute <code>type</code> with the value of <code>module</code> to work since all dependencies would be imported in your script by the <code>import</code> keyword and the module system</li>
</ul>
</div>
</div>
</div>
</body>
</html>
